# 1. Создать программный файл в текстовом формате, записать в него построчно данные,
# вводимые пользователем.
# Об окончании ввода данных будет свидетельствовать пустая строка.


my_str = None       # Объявляем переменную

try:                                        # Проверим, существует ли файл
    with open('task_1.txt') as my_file:     # Если существует...
        pass                                # ... то ничего не делаем
except FileNotFoundError:                   # Если файла нет...
    with open('task_1.txt', mode="w"):      # ... создадим его...
        pass                                # ... но записывать в него пока ничего не будем

with open('task_1.txt') as task_1:          # Проверим число строк в файле
    if len(task_1.readlines()) == 0:        # Если файл пустой...
        new_file = True                     # ... установим флаг
    else:                                   # в ином случае...
        new_file = False                    # ... снимаем флаг

while my_str != "":                         # Ожидаем ввода пустой строки, запрашиваем строку:
    my_str = input("Input string to write in the file, ""--clear"" for clear the file or empty string to exit: ")
    if my_str == "--clear":                             # если ввели специальное значение...
        with open('task_1.txt', mode='w') as task_1:    # ... очищаем файл...
            new_file = True                             # ... и ставим флаг
    else:                                               # в ином случае...
        if new_file:                                        # ... если флаг установлен...
            with open('task_1.txt', mode='a') as task_1:        # ... открываем файл...
                task_1.write(my_str)                                # ... добавляем строку...
            new_file = False                                    # и снимаем флаг
        else:                                               # в ином случае...
            with open('task_1.txt', mode='a') as task_1:        # ... открываем файл...
                task_1.write('\n' + my_str)                         # добавляем перевод строки и строку

print("Output file:")                   # Сообщаем, что сейчас будет выведен файл

with open('task_1.txt') as task_1:      # Открываем файл в режиме чтения...
    print(task_1.read())                # ... и выводим его на экран
